[
{"body": "Finance Minister Arun Jaitley on Wednesday announced that the BJP will celebrate 'Anti-Black Money Day' on November 8 to mark one year since the demonetisation announcement. State BJP chiefs will organise events to highlight the achievements of note ban, he said. This comes a day after the Opposition announced a 'Black Day' to mark the first anniversary of note ban.", "time": "06:49 pm", "headline": "BJP to observe Anti-Black Money Day to mark 1 yr of note ban", "author": "Chhavi Tyagi", "date": "25 Oct 2017,Wednesday"},
{"body": "India's junior men's hockey team defeated USA 22-0, to register its third consecutive win in the Sultan of Johor Cup in Malaysia, on Wednesday. The Indian team has now registered 27 goals in the tournament, having scored five in its earlier two matches. Harmanjit Singh top-scored against USA with five goals, while Abhishek netted four and two others scored hat-tricks.", "time": "06:14 pm", "headline": "Indian jr hockey team thrashes USA 22-0 for 3rd straight win", "author": "Anmol Sharma", "date": "25 Oct 2017,Wednesday"},
{"body": "West Bengal Chief Minister Mamata Banerjee on Wednesday lashed out at the Centre, saying she will not link Aadhaar to her phone number and dared authorities to disconnect her phone if they wanted to. She also urged an audience of about 3,000 party workers and leaders not to link the two and said, \"How many telephone connections will they disconnect?\"", "time": "06:52 pm", "headline": "Won’t link phone to Aadhaar, let them disconnect: CM Mamata", "author": "Chhavi Tyagi", "date": "25 Oct 2017,Wednesday"},
{"body": "Over 100 farmers have reportedly been found linked to a single Aadhaar number in Maharashtra while the authorities were attempting their online registration for the implementation of the state government's loan waiver. \"We always thought that the Aadhaar number will be our key to check fake beneficiaries. Now, we don’t know how to address this challenge,\" an official said.", "time": "06:50 pm", "headline": "100 farmers linked to single Aadhaar number in Maharashtra", "author": "Chhavi Tyagi", "date": "25 Oct 2017,Wednesday"},
{"body": "The Maharashtra government on Tuesday approved the construction of two new Mumbai Metro corridors at a cost of over ₹15,000 crore. The 24-kilometre Metro V corridor, which will connect Thane, Bhiwandi, and Kalyan, is aimed at linking Mumbai to its satellite cities. The 14-kilometre Metro VI corridor will connect business hubs. The corridors are expected to be functional by 2021.", "time": "06:52 pm", "headline": "Maharashtra govt approves 2 new Metro corridors in Mumbai", "author": "Radhika Chugh", "date": "25 Oct 2017,Wednesday"},
{"body": "Amid the Congress slamming the Centre over the alleged failure of GST, Union Finance Minister Arun Jaitley on Wednesday said that national leaders of the Congress have \"no idea\" of the taxation scheme. \"Ascertaining rates for various commodities and fixing tax rates takes time. It is not an overnight process, and this needs to be understood,\" Jaitley added. ", "time": "06:51 pm", "headline": "Congress has no idea of GST: Arun Jaitley", "author": "Chhavi Tyagi", "date": "25 Oct 2017,Wednesday"},
{"body": "Hours after the Election Commission announced the dates for Gujarat Assembly elections, Chief Minister Vijay Rupani on Wednesday said that he is sure about the BJP winning the polls by a three-fourth majority. Meanwhile, the India Today-Axis My India opinion poll revealed that Rupani is the most popular choice to be the CM of Gujarat ahead of the Assembly polls.", "time": "07:04 pm", "headline": "BJP will win Guj polls by three-fourth majority: CM Rupani", "author": "Chhavi Tyagi", "date": "25 Oct 2017,Wednesday"},
{"body": "Technology giant Apple has allowed its suppliers to reduce the accuracy of the iPhone X's Face ID to speed up production, according to reports. Earlier reports suggested that Apple was facing production delay in iPhone X due to problems in the Face ID manufacturing process. The iPhone X is set to launch officially on November 3. ", "time": "06:45 pm", "headline": "Face ID accuracy reduced to up iPhone X production: Report", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "Technology giant Apple has listed out cars which can support wireless charging for the latest models of iPhone devices. The cars including Audi, BMW, Mercedes-Benz, Toyota, and Volkswagen, will charge iPhone 8 and likely the iPhone X. However, Apple warned that only some 2018 GM cars can charge iPhones, including the Chevy Bolt and rides across Buick, Cadillac, and GMC.", "time": "05:08 pm", "headline": "Apple lists cars that can wirelessly charge iPhones", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "Technology giant Apple's CEO Tim Cook has said, \"We'll see what happens\" on iPhone X shortages, in a recent interview. He also said, \"We'll be working as hard as possible to make as many as possible.\" Earlier reports suggested that Apple was facing production delay in iPhone X due to problems in the Face ID manufacturing process.", "time": "06:34 pm", "headline": "We'll see what happens: Apple CEO on iPhone X shortages", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "In a first, UK-based scientists have developed an affordable method to 3D print a flexible energy-storing wristband. The printing method stacks silicone, glue and gel electrolyte layer by layer to make a supercapacitor, which stores energy on its surface without chemical reactions as in a battery. The wristbands could be used in the future to power smartphones, said researchers.", "time": "05:19 pm", "headline": "UK scientists develop first 3D printed wearable 'battery'", "author": "Gaurav Shroff", "date": "25 Oct 2017,Wednesday"},
{"body": "Technology major Apple has confirmed that the iPhone X pre-orders will start from October 27, a week before it is officially launched in India. The latest iPhone features a 5.8-inch edge-to-edge display with facial recognition technology for unlocking the device. The iPhone X is priced at ₹89,000 and ₹1,02,000 for 64 GB and 256 GB variants respectively, in India. ", "time": "06:23 pm", "headline": "Apple's iPhone X pre-orders to start on October 27 in India ", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "Microsoft's CEO Satya Nadella in a blog post about his son with special needs said that he was sad for how things turned out for him and his wife, Anu. \"To say that period of time was difficult is an understatement,\" he wrote. Nadella's son Zain, currently 21 years old, has cerebral palsy and is confined to a wheel chair.", "time": "06:32 pm", "headline": "Was sad how things turned out for me and my wife: Nadella", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "Ride-hailing startup Uber has introduced a feature to charge users extra for longer pickup time in the US. Drivers can also apply a 'per-minute' late fee if they have to wait longer than 2 minutes at the pickup point. Uber will also help drivers avoid tolls \"whenever possible\" or incorporate it into the fare, during pickups.", "time": "05:49 pm", "headline": "Uber to charge users extra for longer pickup time in US", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "Canada has banned the Silicon Valley's 'meal-replacement' drink called Soylent, according to a blog post by Rosa Labs which produces the product. The post states that the Canadian Food Inspection Agency has declared that their product didn't meet standards for a meal replacement. It also mentioned that the startup will work with Canada's food regulator to allow Soylent sales. ", "time": "05:13 pm", "headline": "Canada bans Silicon Valley's meal replacement drink Soylent", "author": "Shifa Naseer", "date": "25 Oct 2017,Wednesday"},
{"body": "Hollywood actress Heather Lind has accused former US President George HW Bush of sexual assault, claiming that the 93-year-old groped her from his wheelchair at a screening of a film. She further alleged that Bush told her a dirty joke. \"President Bush would never...intentionally cause anyone distress, and he...apologises if his attempt at humor offended Ms Lind,\" his spokesperson said.", "time": "06:58 pm", "headline": "Actress accuses ex-US Prez George HW Bush of sexual assault", "author": "Ankush Verma", "date": "25 Oct 2017,Wednesday"},
{"body": "Several fashion magazines and brands have said they'll no longer work with photographer Terry Richardson in response to numerous allegations of inappropriate sexual behaviour against him. The photographer is known for his sexually explicit photoshoots, which often feature him naked alongside models. Richardson's work has also appeared in publications including 'Vogue', 'Vanity Fair' and 'GQ'. \n", "time": "06:01 pm", "headline": "Brands drop Terry Richardson over sexual abuse allegations", "author": "Daisy Mowke", "date": "25 Oct 2017,Wednesday"},
{"body": "Private lender Kotak Mahindra Bank on Wednesday posted a 22% year-on-year rise in profit to ₹994 crore for the quarter ended September 30. Net interest income (NII) or the core income a bank earns by giving loans increased 16% to ₹2,313 crore. Gross bad loans, as a percentage of total loans, stood at 2.47% at the end of September quarter.", "time": "06:52 pm", "headline": "Kotak Mahindra Bank profit rises 22% to ₹994 crore in Q2", "author": "Manaya Bagga", "date": "25 Oct 2017,Wednesday"},
{"body": "Berkshire Hathaway's Chairman and CEO Warren Buffett's net worth reached an all-time high of $81.5 billion on Tuesday. His fortune has increased by $35 billion over the last five years, which converts to $222 per second, according to Bloomberg. Buffett is the third richest person in the world, coming in behind Microsoft Founder Bill Gates and Amazon Founder Jeff Bezos.", "time": "06:54 pm", "headline": "Warren Buffett's net worth reaches a new high of $81.5 bn", "author": "Krishna Veera Vanamali", "date": "25 Oct 2017,Wednesday"},
{"body": "Comedian Kapil Sharma has revealed he had suicidal thoughts and was suffering from depression, while adding, \"As I saw the wide expanse of sea...I felt like jumping into it.\" Kapil added that all the negative publicity he got put him in depression. He further said that it was Shah Rukh Khan who advised him to take some time off. ", "time": "06:41 pm", "headline": "Kapil Sharma reveals he was depressed, had suicidal thoughts", "author": "Tanya Dhingra", "date": "25 Oct 2017,Wednesday"},
{"body": "Fans of singer Lady Gaga have taken to Twitter to slam her new wax statue unveiled in Peru. A user commented, \"How on earth did someone get paid to professionally make a Lady Gaga wax figure that looks like this?\" \"Something went horribly wrong here,\" wrote another user. Meanwhile, another comment read, \"The disrespect is too much!\"", "time": "05:30 pm", "headline": "Lady Gaga's wax statue slammed by fans on Twitter ", "author": "Daisy Mowke", "date": "25 Oct 2017,Wednesday"},
{"body": "Actor Irrfan Khan, while talking about casting couch, revealed, \"It has been hinted to me and sometimes I have been told clearly that if I compromise I'll get the job.\" \"It has come from both males and females,\" he added. Irrfan further said, \"It becomes slightly weird when people you know and respect a lot, give you such offers.\"", "time": "07:01 pm", "headline": "Was asked to compromise for work: Irrfan on casting couch", "author": "Daisy Mowke", "date": "25 Oct 2017,Wednesday"},
{"body": "On being asked if his rivalry with Barcelona forward Lionel Messi was coming to an end, Real Madrid's Cristiano Ronaldo said, \"It didn't finish yet... it is just starting.\" Ronaldo equalled Messi in winning FIFA's best player of the year award five times. \"I don't compete with Leo. He is a player, who is in the same era,\" Ronaldo said. ", "time": "05:24 pm", "headline": "Rivalry with Messi just starting: Cristiano Ronaldo", "author": "Dishant Sharma", "date": "25 Oct 2017,Wednesday"},
{"body": "Brazilian goalkeeper Jefferson was carjacked at gunpoint on Sunday on his way to training in Rio de Janeiro. A CCTV footage has emerged in which Jefferson can be seen kneeling on the pavement as three thugs speed off in the keeper's Range Rover, abandoning their car. The vehicle was reportedly recovered several hours later by police.", "time": "06:20 pm", "headline": "Brazil international goalkeeper carjacked at gunpoint in Rio", "author": "Anmol Sharma", "date": "25 Oct 2017,Wednesday"},
{"body": "Masseuse Leanne Russell claimed in a court that she cried uncontrollably after Windies cricketer Chris Gayle pulled his towel to expose himself to her during the 2015 World Cup in Australia. Russell said Gayle asked her what she was looking for, to which she said, \"A towel\", following which Gayle removed the towel and said, \"Are you looking for this?\"", "time": "05:14 pm", "headline": "Cried uncontrollably after Gayle 'exposed himself': Masseuse", "author": "Dishant Sharma", "date": "25 Oct 2017,Wednesday"}
]