{"body": "India's junior men's hockey team defeated USA 22-0, to register its third consecutive win in the Sultan of Johor Cup in Malaysia, on Wednesday. The Indian team has now registered 27 goals in the tournament, having scored five in its earlier two matches. Harmanjit Singh top-scored against USA with five goals, while Abhishek netted four and two others scored hat-tricks.", "time": "06:14 pm", "date": "25 Oct 2017,Wednesday", "author": "Anmol Sharma", "headline": "Indian jr hockey team thrashes USA 22-0 for 3rd straight win"}{"body": "The benchmark index BSE Sensex closed above 33,000-mark for the first time on Wednesday boosted by a rally in public sector bank stocks. Sensex rose 435.16 points to close at 33,042.50. The Nifty 50 index also climbed 87.65 points to close at a fresh high of 10,295.35. This comes after the Centre announced a ₹2.11-lakh-crore capital infusion plan for banks. ", "time": "06:14 pm", "date": "25 Oct", "author": "Anmol Sharma", "headline": "Sensex closes above 33,000-mark for the first time"}{"body": "The Sonam Kapoor and Kareena Kapoor starrer upcoming film 'Veere Di Wedding' will release on May 18, 2018. It also stars Swara Bhasker, Shikha Talsania and Sumeet Vyas. The film, which revolves around four friends attending a wedding, has been produced by Sonam's sister Rhea Kapoor and directed by Shashanka Ghosh. ", "time": "04:37 pm", "date": "25 Oct 2017,Wednesday", "author": "Krishna Veera Vanamali", "headline": "Release date of Sonam, Kareena's Veere Di Wedding announced"}{"body": "Microsoft's CEO Satya Nadella in a blog post about his son with special needs said that he was sad for how things turned out for him and his wife, Anu. \"To say that period of time was difficult is an understatement,\" he wrote. Nadella's son Zain, currently 21 years old, has cerebral palsy and is confined to a wheel chair.", "time": "04:37 pm", "date": "25 Oct", "author": "Krishna Veera Vanamali", "headline": "Was sad how things turned out for me and my wife: Nadella"}{"body": "Technology giant Apple's CEO Tim Cook has said, \"We'll see what happens\" on iPhone X shortages, in a recent interview. He also said, \"We'll be working as hard as possible to make as many as possible.\" Earlier reports suggested that Apple was facing production delay in iPhone X due to problems in the Face ID manufacturing process.", "time": "04:30 pm", "date": "25 Oct 2017,Wednesday", "author": "Daisy Mowke", "headline": "We'll see what happens: Apple CEO on iPhone X shortages"}{"body": "Technology giant Apple has listed out cars which can support wireless charging for the latest models of iPhone devices. The cars including Audi, BMW, Mercedes-Benz, Toyota, and Volkswagen, will charge iPhone 8 and likely the iPhone X. However, Apple warned that only some 2018 GM cars can charge iPhones, including the Chevy Bolt and rides across Buick, Cadillac, and GMC.", "time": "04:30 pm", "date": "25 Oct", "author": "Daisy Mowke", "headline": "Apple lists cars that can wirelessly charge iPhones"}{"body": "In a first, UK-based scientists have developed an affordable method to 3D print a flexible energy-storing wristband. The printing method stacks silicone, glue and gel electrolyte layer by layer to make a supercapacitor, which stores energy on its surface without chemical reactions as in a battery. The wristbands could be used in the future to power smartphones, said researchers.", "time": "06:32 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "UK scientists develop first 3D printed wearable 'battery'"}{"body": "A Motorola phone user from Haryana has claimed that the phone caught fire after it was put on charge. The model Moto E Power was on charge for 20 minutes after which the phone started emitting smoke, the user said. In response to the incident, Motorola said that it has launched an investigation into the matter. ", "time": "06:32 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Motorola phone catches fire after charging in Haryana"}{"body": "Technology major Apple has confirmed that the iPhone X pre-orders will start from October 27, a week before it is officially launched in India. The latest iPhone features a 5.8-inch edge-to-edge display with facial recognition technology for unlocking the device. The iPhone X is priced at ₹89,000 and ₹1,02,000 for 64 GB and 256 GB variants respectively, in India. ", "time": "06:34 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "Apple's iPhone X pre-orders to start on October 27 in India "}{"body": "A female Uber driver was shot in the neck shortly after picking up two passengers at the San Francisco International airport, earlier this week. She was driving along the freeway when gunshots were fired, according to the California Highway Patrol (CHP). However, CHP Officer Vu Williams said that the motive for the shooting has not been determined.", "time": "06:34 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Female Uber driver shot after picking up two riders in US"}{"body": "Canada has banned the Silicon Valley's 'meal-replacement' drink called Soylent, according to a blog post by Rosa Labs which produces the product. The post states that the Canadian Food Inspection Agency has declared that their product didn't meet standards for a meal replacement. It also mentioned that the startup will work with Canada's food regulator to allow Soylent sales. ", "time": "05:08 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "Canada bans Silicon Valley's meal replacement drink Soylent"}{"body": "Ride-hailing startup Uber has introduced a feature to charge users extra for longer pickup time in the US. Drivers can also apply a 'per-minute' late fee if they have to wait longer than 2 minutes at the pickup point. Uber will also help drivers avoid tolls \"whenever possible\" or incorporate it into the fare, during pickups.", "time": "05:08 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Uber to charge users extra for longer pickup time in US"}{"body": "US-based researchers have documented the effects of chewing on the nano-sized structures that make up the tooth enamel. The researchers observed that at every level of pressure, scratching led to more damage than indentation. With increasing level of pressure, it led to separation of nano-structures termed as \"plucking\", \"deformation\", and breaking of chemical bonds termed as \"fragmentation\".", "time": "05:19 pm", "date": "25 Oct 2017,Wednesday", "author": "Gaurav Shroff", "headline": "Researchers study how chewing affects teeth on nanoscale"}{"body": "Several fashion magazines and brands have said they'll no longer work with photographer Terry Richardson in response to numerous allegations of inappropriate sexual behaviour against him. The photographer is known for his sexually explicit photoshoots, which often feature him naked alongside models. Richardson's work has also appeared in publications including 'Vogue', 'Vanity Fair' and 'GQ'. \n", "time": "05:19 pm", "date": "25 Oct", "author": "Gaurav Shroff", "headline": "Brands drop Terry Richardson over sexual abuse allegations"}{"body": "Anil Ambani-led Reliance Communications (RCom) will shut down its direct-to-home (DTH) business, operating under Reliance Digital TV, effective November 18. Reliance Digital TV, which is the smallest player with a market share of 2%, cited expiry of DTH licence as the reason for closure. RCom has said that it is working with three other DTH operators to migrate its customers.", "time": "04:33 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "RCom to shut down its DTH operations from November 18"}{"body": "Fans of singer Lady Gaga have taken to Twitter to slam her new wax statue unveiled in Peru. A user commented, \"How on earth did someone get paid to professionally make a Lady Gaga wax figure that looks like this?\" \"Something went horribly wrong here,\" wrote another user. Meanwhile, another comment read, \"The disrespect is too much!\"", "time": "04:33 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Lady Gaga's wax statue slammed by fans on Twitter "}{"body": "Actress Alia Bhatt, while talking about Deepika Padukone playing the titular character in the upcoming film 'Padmavati', said, \"I know I can never look like that or act like that...she just looks like a Queen.\" Alia added, \"I also told her 'you are so lovely and so inspiring'.\" She further said that she is looking forward to seeing the film. ", "time": "06:23 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "Can never look, act like that: Alia on Deepika as Padmavati"}{"body": "British actor Idris Elba, who hosted the Best FIFA Football Awards ceremony on Monday, posed for a selfie with FIFA Team of 2017, featuring players with a combined market value of ₹5,300 crore, as per the CIES Football Observatory. The team includes world's most expensive player Neymar, former most expensive player Real Madrid's Cristiano Ronaldo, Barcelona's Lionel Messi among others.", "time": "06:23 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "FIFA Team of the Year selfie features players worth ₹5,300cr"}{"body": "Masseuse Leanne Russell claimed in a court that she cried uncontrollably after Windies cricketer Chris Gayle pulled his towel to expose himself to her during the 2015 World Cup in Australia. Russell said Gayle asked her what she was looking for, to which she said, \"A towel\", following which Gayle removed the towel and said, \"Are you looking for this?\"", "time": "04:34 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "Cried uncontrollably after Gayle 'exposed himself': Masseuse"}{"body": "On being asked if his rivalry with Barcelona forward Lionel Messi was coming to an end, Real Madrid's Cristiano Ronaldo said, \"It didn't finish yet... it is just starting.\" Ronaldo equalled Messi in winning FIFA's best player of the year award five times. \"I don't compete with Leo. He is a player, who is in the same era,\" Ronaldo said. ", "time": "04:34 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Rivalry with Messi just starting: Cristiano Ronaldo"}{"body": "Brazilian goalkeeper Jefferson was carjacked at gunpoint on Sunday on his way to training in Rio de Janeiro. A CCTV footage has emerged in which Jefferson can be seen kneeling on the pavement as three thugs speed off in the keeper's Range Rover, abandoning their car. The vehicle was reportedly recovered several hours later by police.", "time": "05:13 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "Brazil international goalkeeper carjacked at gunpoint in Rio"}{"body": "Harbhajan Singh slammed former IPS officer from Gujarat Sanjiv Bhatt after he alleged there are communal differences in Indian cricket and asked if there are Muslims in the team. \"Hindus, Muslims, Sikhs and Christians are all brothers. Every player in the team is an Indian and there's no place for discussions on basis of their caste or colour\", tweeted Harbhajan.", "time": "05:13 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Every player in Team India 'Hindustani': Harbhajan to ex-cop"}{"body": "Indian shuttler Kidambi Srikanth was felicitated by the Indian embassy in Paris as the Denmark Open Super Series Premier winner reached the French capital for the French Open, which started on Tuesday. Srikanth, on Sunday, became only the second Indian to win the men's singles title in Denmark after Prakash Padukone won the tournament in 1980.", "time": "05:49 pm", "date": "25 Oct 2017,Wednesday", "author": "Shifa Naseer", "headline": "Kidambi Srikanth felicitated by Indian embassy in Paris"}{"body": "US-based University of Michigan researchers have proposed an algorithm that could transform any body cell into any other cell type. The technique avoids all the intermediate steps involved in other techniques, which produce stem cells that can develop into a desired cell type. The concept could have applications including regenerating diseased or lost tissue, and fighting cancer, said researchers.", "time": "05:49 pm", "date": "25 Oct", "author": "Shifa Naseer", "headline": "Scientists propose way to turn any cell to desired cell type"}{"body": "A brace from Jesse Lingard helped Manchester United beat Swansea 2-0 and progress to the League Cup's quarterfinal. Meanwhile, Manchester City were taken to penalties where Claudio Bravo's two saves helped the side register a 4-1 win over Wolves. Arsenal were on course for an exit before youngster Eddie Nketiah scored a brace to help them brush past Norwich.", "time": "04:25 pm", "date": "25 Oct 2017,Wednesday", "author": "Gaurav Shroff", "headline": "Man Utd, Man City, Arsenal progress to League Cup quarters"}